haskell.mooc.fi_Notes.tex
% Created 2026-05-20 Wed 18:04
% Intended LaTeX compiler: lualatex
\documentclass[11pt]{report}

\usepackage{amsmath}
\usepackage{fontspec}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{fontspec}
\usepackage{graphicx}
\usepackage[utf8]{inputenc}
\usepackage{tikz, pgfplots}
\usetikzlibrary{shapes.geometric, positioning}
\usepackage{svg}
\usepackage{emoji}
\author{Jiang and Sharma}
\date{\textit{<2026-05-19 Tue>}}
\title{HaskellMOOC.fi Notes}
\hypersetup{
 pdfauthor={Jiang and Sharma},
 pdftitle={HaskellMOOC.fi Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\part{Lecture 1: And so It Begins}
\label{sec:org0b40bb5}
\chapter{Haskell Characteristics}
\label{sec:org66702ed}
\begin{itemize}
\item Functional, pure, and lazy
\item Strongly typed with type inference
\item Garbage collected and compiled
\item \textbf{Tooling}: `stack ghci` (REPL), `:t` (type), `:load`, `:reload`
\end{itemize}
\chapter{Fundamental Concepts}
\label{sec:orgf5dadfa}
\begin{itemize}
\item \textbf{Expressions}: Everything is an expression (no statements)
\item \textbf{Application}: `f x y` (not `f(x,y)`); function calls bind tightest
\item \textbf{Basic Types}: `Int`, `Integer`, `Double`, `Bool`, `String` (`[Char]`)
\item \textbf{Currying}: `a -> b -> c` represents multi-argument functions
\end{itemize}
\chapter{Program Structure}
\label{sec:orgd28a407}
\begin{itemize}
\item \textbf{Modules}: One per file
\item \textbf{Definitions}: Optional type signature + equations
\item \textbf{Logic}: `if\ldots{}then\ldots{}else` (else is mandatory), `where`/`let`
\item \textbf{Immutability}: Bindings are constant; ``updates'' create new values
\end{itemize}
\part{Lecture 2: Recursion \& Lists}
\label{sec:orgbf0c043}
\chapter{Recursion \& Control Flow}
\label{sec:orgb8a05e5}
\begin{itemize}
\item \textbf{Helper Functions}: Often marked with `'` (e.g., `fibonacci'`) to manage state
\item \textbf{Tail Recursion}: Recursive call is the last action \(\rightarrow\) optimizes to a loop
\item \textbf{Guards}: `| condition = value` (first true guard wins)
\end{itemize}
\chapter{Lists \& Polymorphism}
\label{sec:orge35815c}
\begin{itemize}
\item \textbf{Lists}: Homogeneous `[a]`, singly-linked, constructed via cons `:`
\item \textbf{Common Ops}: `head`, `tail`, `take`, `drop`, `++`, `!!`, `reverse`
\item \textbf{Polymorphism}: Lowercase type variables (e.g., `a`) determined by unification
\end{itemize}
\chapter{Handling Optionality}
\label{sec:orgd432a5e}
\begin{itemize}
\item \textbf{Maybe a}: `Nothing | Just x` (Safe alternative to null)
\item \textbf{Either a b}: `Left a | Right b` (Commonly used for success/error)
\item \textbf{Case expressions}: `case \ldots{} of` for complex pattern matching
\end{itemize}
\part{Lecture 3: Higher-Order Functions}
\label{sec:org4b3d25a}
\chapter{Functions as First-Class Citizens}
\label{sec:orgb8266b8}
\begin{itemize}
\item \textbf{HOFs}: Functions that take or return functions (e.g., `map`, `filter`)
\item \textbf{Partial Application}: `add 3` returns a function waiting for the second arg
\item \textbf{Sections}: Partially applied operators, e.g., `(+1)`, `(*2)`
\end{itemize}
\chapter{Composition \& Lambdas}
\label{sec:orge0f406e}
\begin{itemize}
\item \textbf{Composition}: `(f . g) x = f (g x)`
\item \textbf{Application Operator}: `\$` (low precedence, avoids parentheses)
\item \textbf{Lambdas}: Anonymous functions `\x -> x + 1`
\end{itemize}
\chapter{Advanced List Patterns}
\label{sec:org1efad50}
\begin{itemize}
\item \textbf{Comprehensions}: `[x | x <- xs, cond]`
\item \textbf{Recursion Patterns}: Building via `:` and consuming via `x:xs`
\item \textbf{Typed Holes}: Using `\_` to let GHC suggest missing types
\end{itemize}
\part{Lecture 4: Type Classes \& Folds}
\label{sec:org65d9151}
\chapter{Tuples \& Folds}
\label{sec:orgdcc31d4}
\begin{itemize}
\item \textbf{Tuples}: Fixed-length, mixed types; accessed via `fst`/`snd`
\item \textbf{foldr}: ``Crunches'' a list into a single value
\begin{itemize}
\item `foldr f z [] = z`
\item `foldr f z (x:xs) = f x (foldr f z xs)`
\end{itemize}
\end{itemize}
\chapter{Type Classes}
\label{sec:org37ee744}
\begin{itemize}
\item \textbf{Definition}: Groups of types sharing common operations (not OOP classes)
\item \textbf{Constraints}: `(Eq a) => \ldots{}` restricts polymorphism to types that implement `Eq`
\item \textbf{Key Classes}:
\begin{itemize}
\item `Eq` (\(\approx\), \(\neq\)) and `Ord` (\(<\), \(>\), `compare`)
\item `Num` \(\rightarrow\) `Integral` / `Fractional` \(\rightarrow\) `Floating`
\item `Show` (to string) and `Read` (from string)
\end{itemize}
\end{itemize}
\part{Lecture 5: Algebraic Datatypes (ADTs)}
\label{sec:org82edf15}
\chapter{Defining Custom Types}
\label{sec:org3b27008}
\begin{itemize}
\item \textbf{ADTs}: Sum of constructors, product of fields (`data T = C1 | C2 Int String`)
\item \textbf{Deriving}: Automatic implementation of `Show`, `Eq`, `Read`
\item \textbf{Type Parameters}: Generic types, e.g., `data Maybe a`
\end{itemize}
\chapter{Recursive Types \& Trees}
\label{sec:org2f3404b}
\begin{itemize}
\item \textbf{Recursive Types}: Types that refer to themselves (e.g., custom `List a`)
\item \textbf{Trees}: `Node val left right | Empty`
\item \textbf{Operations}: Height calculation, BST lookup, and insertion
\end{itemize}
\chapter{Record Syntax}
\label{sec:orgadf22ef}
\begin{itemize}
\item Named fields instead of positional arguments
\item Automatically generates accessor functions
\item Improves readability and maintainability for large data structures
\end{itemize}
\part{Lecture 6: Working Class Hero}
\label{sec:org552ebde}

\chapter{Lecture Contents:}
\label{sec:org9634408}
\begin{itemize}
\item Defining new Type Classes
\item Instantiating class using \(instance\) and \(deriving\) keywords
\end{itemize}
\end{document}
